{
  "1.3.1": {
    "name": "1.3.1 Info and Relationships",
    "desc": "Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text."
  },
  "1.3.2": {
    "name": "1.3.2 Meaningful Sequence",
    "desc": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined."
  },
  "1.3.3": {
    "name": "1.3.3 Sensory Characteristics",
    "desc": "Instructions provided for understanding and operating content do not rely solely on sensory characteristics of components such as shape, size, visual location, orientation, or sound."
  },
  "1.3.5": {
    "name": "1.3.5 Identify Input Purpose",
    "desc": "The HTML autocomplete attribute only accepts a certain number of specific well-defined fixed values. This allows a more fine-grained definition or identification of purpose than the type attribute."
  },
  "2.1.1": {
    "name": "2.1.1 Keyboard",
    "desc": "Everything can be done with a keyboard except freehand movements."
  },
  "2.1.2": {
    "name": "2.1.2 No Keyboard Trap",
    "desc": "Keyboard users don't get stuck."
  },
  "2.2.2": {
    "name": "2.2.2 Timing Adjustable",
    "desc": "Users have adequate time to complete tasks."
  },
  "2.4.3": {
    "name": "2.4.3 Focus Order",
    "desc": "Keyboard users navigate content in a correct order. Elements receive focus in an order that preserves meaning."
  },
  "2.5.3": {
    "name": "2.5.3 Label in Name",
    "desc": "<a href='https://www.w3.org/WAI/WCAG21/Understanding/label-in-name.html#' target='_blank'> The intent of this criterion is to ensure that the label for a control that a user sees on a page matches the accessible name of that control recognized by assistive technology. If these names do not match, then users who use speech to control their screen may have difficulty activating controls on the screen. </a>"
  },
  "2.5.2": {
    "name": "2.5.2 Pointer Cancellation",
    "desc": "For functionality that can be operated using a single pointer, the function completes on the up-event or offers an ability to abort, undo, or reverse the outcome."
  },
  "3.2.2": {
    "name": "3.2.2 On Input",
    "desc": "Content can be operated more predictably. Forewarn users if their context will change based on their input."
  },
  "3.2.4": {
    "name": "3.2.4 Consistent Identification",
    "desc": "Components that have the same functionality within a set of content are identified consistently."
  },
  "3.2.6": {
    "name": "3.2.6 Consistent Help",
    "desc": "Put help in the same place when it is on multiple pages."
  },
  "3.3.1": {
    "name": "3.3.1 Error Identification",
    "desc": "If an input error is automatically detected, the item that is in error is identified and the error is described to the user in text."
  },
  "3.3.2": {
    "name": "3.3.2 Labels or Instructions",
    "desc": "<a href='https://www.w3.org/WAI/WCAG21/Understanding/labels-or-instructions.html' target='_blank'> Labels or instructions are provided when content requires user input. </a>"
  },
  "3.3.3": {
    "name": "3.3.3 Error Suggestion",
    "desc": "If an input error is automatically detected and suggestions for correction are known, then the suggestions are provided to the user, unless it would jeopardize the security or purpose of the content."
  },
  "3.3.7": {
    "name": "3.3.4 Redundant Entry",
    "desc": "Don't ask for the same information twice in the same session."
  },
  "4.1.2": {
    "name": "4.1.2 Name, Role, Value",
    "desc": "<a href='https://www.w3.org/WAI/WCAG21/Understanding/name-role-value.html' target='_blank'>For all user interface components (including but not limited to: form elements, links, and components generated by scripts), the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies.</a>"
  },
  "4.1.3": {
    "name": "4.1.3 Status Messages",
    "desc": "In content implemented using markup languages, status messages can be programmatically determined through role or properties so that messages can be presented by assistive technologies without receiving focus."
  }
}
